In [14]:
# How to delete matching rows in one dataframe?
#    - df1 and df2 have "id" column
#    - Delete rows from df1 if a row in df2 has "id" of same value
import pandas as pd

df1 = pd.DataFrame(
    data={"id": [1, 2, 3, 4], "col1": [9, 8, 7, 6], "col2": [5, 4, 3, 2]},
    columns=["id", "col1", "col2"],
)
df2 = pd.DataFrame(
    data={"id": [3, 4, 7], "col3": [11, 12, 13], "col4": [15, 16, 17]},
    columns=["id", "col3", "col4"],
)

df1.head()

   id  col1  col2
0   1     9     5
1   2     8     4
2   3     7     3
3   4     6     2

# Option 1: pd.merge()

In [2]:
# df2 already has "id" with "3" and "4"
df2.head()

   id  col3  col4
0   3    11    15
1   4    12    16
2   7    13    17

In [3]:
# Delete "matching" rows in df1:

# One solution: 
# Step 1 - merge the two dataframes into a new dataframe using "the one that has the rows you want to delete in it" as the "left"

# We want to remove rows from df1 if they have a matching row in df2, so df1 is our "left"
df_1_2 = df1.merge(df2, on="id", how="left", indicator=True)

# Step 2: Drop all rows that are found in both (i.e. delete the inner join matches)
df_1_not_2 = df_1_2[df_1_2["_merge"] == "left_only"].drop(columns=["_merge"])

df_1_2.head()

   id  col1  col2  col3  col4     _merge
0   1     9     5   NaN   NaN  left_only
1   2     8     4   NaN   NaN  left_only
2   3     7     3  11.0  15.0       both
3   4     6     2  12.0  16.0       both

In [4]:
df_1_not_2.head()

   id  col1  col2  col3  col4
0   1     9     5   NaN   NaN
1   2     8     4   NaN   NaN

In [7]:
# Step 3: Overwrite the df1 variable with the values from Step 2 above
df1 = df_1_not_2[['id', 'col1', 'col2']].copy()
df1.head()

   id  col1  col2
0   1     9     5
1   2     8     4

# Option 2: Use `.isin()`

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html

In [20]:
df1 = df1[df1.id.isin(df2.id)].copy()

df1.head()

   id  col1  col2
2   3     7     3
3   4     6     2